/* No comment provided by engineer. */
"AppleScript.authorization.error" = "У Dynamic Dark Mode нет разрешения управлять темным оформлением";

/* Generic error happened */
"AppleScript.authorization.failed" = "Что-то пошло не так";

/* No comment provided by engineer. */
"AppleScript.authorization.instruction" = "Переход в Системные настройки.";

/* Something went wrong. But it's okay */
"AppleScript.execute.error" = "Не удалось сменить оформление";

/* Scare the user so they report bugs. */
"Bug.general.title" = "Сообщить об ошибке разработчикам";

/* Request users to provide more context. */
"Bug.known.title" = "Это известная проблема";

/* User did not authorize this app to use location. */
"Location.notAuthorized" = "Предоставьте Dynamic Dark Mode доступ к вашему местоположению.";

/* Failed to attain user location for sunset/sunrise calculation. */
"Location.notAvailable" = "Не удалось определить местоположение";

/* Took too long to use up retries, most likely off Wi-Fi. */
"Location.timeout" = "Проверьте подключение к интернету.";

/* Can't fetch user's current location. Using cache instead. */
"Location.useCache" = "Расписание составлено на основе последней геолокации";

/* Drop down menu item to show preferences */
"Menu.preferences" = "Настройки…";

/* Use system translation for quit */
"Menu.quit" = "Выход";

/* Action item to toggle in from menu bar */
"Menu.toggle" = "Сменить режим";

/* User did not authorize this app to send notifications. */
"Notification.notAuthorized" = "Разрешите Dynamic Dark Mode слать уведомления.";

/* Indicates either enable or disable opens at login failed. */
"Preferences.opensAtLogin.failed" = "Не удалось обновить настройку \"Запустить при входе в систему\"";

/* Notification text for bug report */
"ScreenBrightnessObserver.startObserving.failed" = "Cannot observe screen brightness change.";

/* For touch bar button title */
"SettingsViewController.autoAdjustThreshold" = "Автонастройка порога";

/* For touch bar button title */
"SettingsViewController.scheduleMode" = "Расписание";

/* Astronomical */
"SunsetSunrise.astronomical" = "Астрономическое";

/* Civil */
"SunsetSunrise.civil" = "Гражданское";

/* CustomRange */
"SunsetSunrise.customRange" = "Пользовательское";

/* Nautical */
"SunsetSunrise.nautical" = "Навигационное";

/* Official */
"SunsetSunrise.official" = "Официальное";

/* No comment provided by engineer. */
"SystemPreferences.open" = "Открыть Системные настройки";

/* No comment provided by engineer. */
"SystemPreferences.skip" = "Пропустить";

